InformationRegisters/ИндексыНумерации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ИндексыНумерации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыВнутреннихДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыВходящихДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ВопросыДеятельности</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыИсходящихДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИндексыНумерации/Ext/ManagerModule.bsl
// Устанавливает значение индекса для переданного объекта.
//
//Параметры:
// Объект - СправочникСсылка.Контрагенты,
//           СправочникСсылка.СтруктураПредприятия,
//           СправочникСсылка.ВидыВнутреннихДокументов,
//           СправочникСсылка.Организации,
//           СправочникСсылка.ВидыВходящихДокументов,
//           СправочникСсылка.ВопросыДеятельности,
//           СправочникСсылка.ВидыИсходящихДокументов - ссылка на объект, для которого устанавливаем индекс нумерации.
// Индекс - Строка - устанавливаемый индекс
//
Процедура ЗаписатьИндексНумерации(Объект, Индекс) Экспорт
	
	Запись = РегистрыСведений.ИндексыНумерации.СоздатьМенеджерЗаписи();
	Запись.Объект = Объект;
	Запись.Прочитать();
	
	Запись.Объект = Объект;
	Запись.Индекс = Индекс;
	Запись.Записать(Истина);
	
КонецПроцедуры

// Возвращает значение индекса нумерации переданного объекта.
//
//Параметры:
// Объект - СправочникСсылка.Контрагенты,
//           СправочникСсылка.СтруктураПредприятия,
//           СправочникСсылка.ВидыВнутреннихДокументов,
//           СправочникСсылка.Организации,
//           СправочникСсылка.ВидыВходящихДокументов,
//           СправочникСсылка.ВопросыДеятельности,
//           СправочникСсылка.ВидыИсходящихДокументов - ссылка на объект, для которого получаем индекс нумерации.
//
Функция ПолучитьИндексНумерации(Объект) Экспорт
	
	Запись = РегистрыСведений.ИндексыНумерации.СоздатьМенеджерЗаписи();
	Запись.Объект = Объект;
	Запись.Прочитать();
	
	Возврат СокрЛП(Запись.Индекс);
	
КонецФункции

// Удаляет значение индекса для переданного объекта.
//
//Параметры:
// Объект - СправочникСсылка.Контрагенты,
//           СправочникСсылка.СтруктураПредприятия,
//           СправочникСсылка.ВидыВнутреннихДокументов,
//           СправочникСсылка.Организации,
//           СправочникСсылка.ВидыВходящихДокументов,
//           СправочникСсылка.ВопросыДеятельности,
//           СправочникСсылка.ВидыИсходящихДокументов - ссылка на объект, для которого удаляем индекс нумерации.
//
Процедура УдалитьИндексНумерации(Объект) Экспорт
	
	Запись = РегистрыСведений.ИндексыНумерации.СоздатьМенеджерЗаписи();
	Запись.Объект = Объект;
	Запись.Удалить();
	
КонецПроцедуры
